[
    {
      "id": "613b8b1c28a914001b7d28a1",
      "title": "Coffee",
      "steps": [
        "Boil 1 cup of water in a kettle.",
        "Add 1-2 teaspoons of coffee powder to a cup.",
        "Pour hot water into the cup over the coffee powder.",
        "Stir well until the coffee powder dissolves.",
        "Add sugar and milk to taste, stir again."
      ],
      "image": "/coffee.jpg",
      "description": "A simple yet refreshing cup of coffee to kickstart your day.",
      "ingredients": [
        "1 cup water",
        "1-2 teaspoons coffee powder",
        "Sugar",
        "Milk"
      ],
      "cookingTime": "5 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a2",
      "title": "Sandwich",
      "steps": [
        "Take 2 slices of bread and spread butter on one side of each slice.",
        "Layer lettuce leaves, sliced tomatoes, cucumber, and cheese on one slice.",
        "Place the other slice of bread on top, butter side down.",
        "Press gently and cut the sandwich diagonally."
      ],
      "image": "/sandwich.jpg",
      "description": "A quick and easy vegetable sandwich for a light meal.",
      "ingredients": [
        "2 slices of bread",
        "Butter",
        "Lettuce",
        "Tomato",
        "Cucumber",
        "Cheese"
      ],
      "cookingTime": "10 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a3",
      "title": "Pan Cake",
      "steps": [
        "In a mixing bowl, combine 1 cup of flour, 2 tablespoons of sugar, and 1 teaspoon of baking powder.",
        "Gradually add 1 cup of milk while whisking to form a smooth batter.",
        "Heat a non-stick pan over medium heat and grease lightly with butter.",
        "Pour a ladleful of batter onto the pan and spread it in a circular motion.",
        "Cook until bubbles form on the surface, then flip and cook the other side until golden brown."
      ],
      "image": "/pancake.jpg",
      "description": "Fluffy pancakes perfect for a hearty breakfast.",
      "ingredients": [
        "1 cup flour",
        "2 tbsp sugar",
        "1 tsp baking powder",
        "1 cup milk",
        "Butter"
      ],
      "cookingTime": "20 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a4",
      "title": "Chicken Biryani",
      "steps": [
        "Wash and soak 1 cup of basmati rice for 30 minutes, then drain.",
        "Marinate 500g of chicken pieces with yogurt, ginger-garlic paste, and biryani masala for 1 hour.",
        "In a large pot, heat 2 tablespoons of ghee and sauté thinly sliced onions until golden brown.",
        "Add the marinated chicken and cook until the chicken is half-done.",
        "Layer the half-cooked rice over the chicken, sprinkle fried onions, mint leaves, and saffron milk.",
        "Cover and cook on low heat for 20-25 minutes until the rice and chicken are fully cooked."
      ],
      "image": "/biryani.jpg",
      "description": "A flavorful and aromatic rice dish with spiced chicken.",
      "ingredients": [
        "1 cup basmati rice",
        "500g chicken",
        "Yogurt",
        "Ginger-garlic paste",
        "Biryani masala",
        "Ghee",
        "Onion",
        "Mint leaves",
        "Saffron"
      ],
      "cookingTime": "1 hour 30 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a5",
      "title": "Chicken Kebabs",
      "steps": [
        "Cut 500g of boneless chicken into cubes.",
        "In a bowl, mix 2 tablespoons of yogurt, 1 tablespoon of ginger-garlic paste, 1 teaspoon of red chili powder, 1/2 teaspoon of turmeric powder, 1 teaspoon of garam masala, and salt to taste.",
        "Marinate the chicken cubes in the mixture for at least 2 hours in the refrigerator.",
        "Thread the marinated chicken cubes onto skewers.",
        "Grill the kebabs on medium heat for 10-12 minutes, turning occasionally until cooked through and lightly charred."
      ],
      "image": "/chicken_kebab.jpeg",
      "description": "Spicy and succulent kebabs made from marinated chicken.",
      "ingredients": [
        "500g boneless chicken",
        "Yogurt",
        "Ginger-garlic paste",
        "Spices",
        "Salt"
      ],
      "cookingTime": "30 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a6",
      "title": "Zinger Burger",
      "steps": [
        "Marinate 2 chicken fillets in 2 tablespoons of yogurt, 1 teaspoon of mustard paste, 1/2 teaspoon of black pepper powder, and salt for 1 hour.",
        "Coat the marinated chicken fillets with a mixture of 1 cup of all-purpose flour, 1 teaspoon of paprika powder, 1/2 teaspoon of garlic powder, and salt to taste.",
        "Deep fry the coated chicken fillets in hot oil until golden brown and crispy.",
        "Slice burger buns in half and toast lightly.",
        "Spread mayonnaise, ketchup, and mustard sauce on the toasted buns.",
        "Layer with lettuce leaves, tomato slices, and the fried chicken fillets.",
        "Cover with the top half of the bun and serve hot with fries."
      ],
      "image": "/zinger.jpg",
      "description": "A crispy and juicy chicken burger with a zesty twist.",
      "ingredients": [
        "2 chicken fillets",
        "Yogurt",
        "Mustard paste",
        "Black pepper",
        "Flour",
        "Paprika powder",
        "Garlic powder",
        "Burger buns",
        "Mayonnaise",
        "Ketchup"
      ],
      "cookingTime": "40 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a7",
      "title": "Aloo Gosht",
      "steps": [
        "Heat oil in a pot and fry 1 finely chopped onion until golden brown.",
        "Add 1 tablespoon of ginger-garlic paste and fry for a minute.",
        "Add 500g of mutton pieces and cook until browned on all sides.",
        "Stir in 2 teaspoons of red chili powder, 1 teaspoon of turmeric powder, 1 teaspoon of cumin powder, and salt to taste.",
        "Add 2 cups of water and cook on low heat until the mutton is tender.",
        "Add 2 peeled and cubed potatoes and cook until they are soft and the gravy thickens."
      ],
      "image": "/aloo_gosht.jpg",
      "description": "A delicious and hearty curry made with mutton and potatoes.",
      "ingredients": [
        "500g mutton",
        "2 potatoes",
        "1 onion",
        "Ginger-garlic paste",
        "Red chili powder",
        "Turmeric powder",
        "Cumin powder",
        "Salt",
        "Oil"
      ],
      "cookingTime": "1 hour 15 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a8",
      "title": "Palak Paneer",
      "steps": [
        "Blanch 250g of spinach in boiling water for 2 minutes, then drain and puree.",
        "Heat 2 tablespoons of oil in a pan and sauté 1 chopped onion until translucent.",
        "Add 1 tablespoon of ginger-garlic paste and cook for a minute.",
        "Add 1 chopped tomato, 1 teaspoon of cumin powder, 1 teaspoon of garam masala, and salt to taste. Cook until the tomato is soft.",
        "Add the spinach puree and cook for 5 minutes.",
        "Stir in 200g of cubed paneer and cook for another 5 minutes."
      ],
      "image": "/palak_paneer.jpg",
      "description": "A creamy and nutritious dish made with spinach and paneer.",
      "ingredients": [
        "250g spinach",
        "200g paneer",
        "1 onion",
        "1 tomato",
        "Ginger-garlic paste",
        "Cumin powder",
        "Garam masala",
        "Salt",
        "Oil"
      ],
      "cookingTime": "30 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28a9",
      "title": "Chana Masala",
      "steps": [
        "Soak 1 cup of chickpeas overnight, then drain and cook in 3 cups of water until tender.",
        "Heat 2 tablespoons of oil in a pan and sauté 1 chopped onion until golden brown.",
        "Add 1 tablespoon of ginger-garlic paste and cook for a minute.",
        "Add 1 chopped tomato, 1 teaspoon of turmeric powder, 1 teaspoon of coriander powder, 1 teaspoon of garam masala, and salt to taste.",
        "Cook until the tomato is soft, then add the cooked chickpeas and 1 cup of water.",
        "Simmer for 15 minutes, then garnish with chopped coriander leaves."
      ],
      "image": "/chana_masala.jpg",
      "description": "A spicy and tangy chickpea curry that is perfect with rice or roti.",
      "ingredients": [
        "1 cup chickpeas",
        "1 onion",
        "1 tomato",
        "Ginger-garlic paste",
        "Turmeric powder",
        "Coriander powder",
        "Garam masala",
        "Salt",
        "Oil",
        "Coriander leaves"
      ],
      "cookingTime": "45 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28aa",
      "title": "Chicken Karahi",
      "steps": [
        "Heat 2 tablespoons of oil in a karahi (wok) and sauté 1 chopped onion until translucent.",
        "Add 1 tablespoon of ginger-garlic paste and cook for a minute.",
        "Add 500g of chicken pieces and cook until they turn white.",
        "Add 2 chopped tomatoes, 1 teaspoon of red chili powder, 1 teaspoon of turmeric powder, 1 teaspoon of garam masala, and salt to taste.",
        "Cook on high heat until the tomatoes are soft and the oil separates.",
        "Garnish with chopped green chilies and coriander leaves before serving."
      ],
      "image": "/karahi.jpg",
      "description": "A popular and flavorful Pakistani chicken dish cooked in a wok.",
      "ingredients": [
        "500g chicken",
        "1 onion",
        "2 tomatoes",
        "Ginger-garlic paste",
        "Red chili powder",
        "Turmeric powder",
        "Garam masala",
        "Salt",
        "Oil",
        "Green chilies",
        "Coriander leaves"
      ],
      "cookingTime": "40 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28b1",
      "title": "French Fries",
      "steps": [
        "Peel and cut 3 large potatoes into thin strips.",
        "Soak the potato strips in cold water for 30 minutes to remove excess starch.",
        "Drain the potatoes and pat them dry with a kitchen towel.",
        "Heat oil in a deep fryer or large pot to 350°F (175°C).",
        "Fry the potatoes in batches for 4-5 minutes until they are soft but not browned. Remove and drain on paper towels.",
        "Increase the oil temperature to 375°F (190°C).",
        "Fry the potatoes again in batches for 2-3 minutes until they are golden brown and crispy.",
        "Remove from oil, drain on paper towels, and immediately season with salt.",
        "Serve hot with your favorite dipping sauce."
      ],
      "image": "/fries.jpg",
      "description": "Crispy and golden French fries, perfect as a snack or side dish.",
      "ingredients": ["3 large potatoes", "Oil for frying", "Salt"],
      "cookingTime": "1 hour"
    },
    {
      "id": "613b8b1c28a914001b7d28ab",
      "title": "Gulab Jamun",
      "steps": [
        "In a bowl, mix 1 cup of milk powder, 1/4 cup of all-purpose flour, 1/4 teaspoon of baking soda, and 2 tablespoons of ghee.",
        "Add milk gradually to form a soft dough.",
        "Make small balls from the dough and deep fry in hot oil until golden brown.",
        "In another pot, heat 1 cup of sugar and 1 cup of water until the sugar dissolves and the syrup thickens slightly.",
        "Soak the fried balls in the sugar syrup for at least 30 minutes before serving."
      ],
      "image": "/gulab_jamun.jpg",
      "description": "A traditional Indian dessert made from deep-fried dough balls soaked in sweet syrup.",
      "ingredients": [
        "1 cup milk powder",
        "1/4 cup all-purpose flour",
        "1/4 tsp baking soda",
        "2 tbsp ghee",
        "Milk",
        "Oil for frying",
        "1 cup sugar",
        "1 cup water"
      ],
      "cookingTime": "1 hour"
    },
    {
      "id": "613b8b1c28a914001b7d28ac",
      "title": "Haleem",
      "steps": [
        "Soak 1 cup of wheat, 1/2 cup of split chana dal, 1/2 cup of split masoor dal, and 1/2 cup of split urad dal overnight.",
        "In a large pot, cook 500g of beef or mutton with 1 chopped onion, 1 tablespoon of ginger-garlic paste, 1 teaspoon of turmeric powder, and salt to taste until tender.",
        "Add the soaked grains and lentils to the meat along with 5 cups of water.",
        "Cook on low heat for 4-5 hours, stirring occasionally, until the grains are completely soft and the mixture is thickened.",
        "Blend the mixture to a smooth consistency using a hand blender.",
        "Garnish with fried onions, green chilies, coriander leaves, and a squeeze of lemon juice before serving."
      ],
      "image": "/haleem.jpg",
      "description": "A rich and hearty stew made with wheat, meat, and lentils, slow-cooked to perfection.",
      "ingredients": [
        "1 cup wheat",
        "1/2 cup chana dal",
        "1/2 cup masoor dal",
        "1/2 cup urad dal",
        "500g beef or mutton",
        "1 onion",
        "Ginger-garlic paste",
        "Turmeric powder",
        "Salt",
        "Water",
        "Fried onions",
        "Green chilies",
        "Coriander leaves",
        "Lemon juice"
      ],
      "cookingTime": "5 hours"
    },
    {
      "id": "613b8b1c28a914001b7d28ad",
      "title": "Aloo Paratha",
      "steps": [
        "Boil and mash 2 large potatoes.",
        "Add 1 chopped onion, 1 chopped green chili, 1 teaspoon of cumin seeds, 1 teaspoon of garam masala, and salt to taste to the mashed potatoes. Mix well.",
        "Divide the dough into small balls and roll each ball into a small circle.",
        "Place a spoonful of the potato mixture in the center of the dough circle and fold the edges to seal.",
        "Roll the filled dough ball into a larger circle, being careful not to let the filling spill out.",
        "Heat a tawa or skillet over medium heat and cook the paratha on both sides until golden brown, applying ghee or oil as needed."
      ],
      "image": "/aloo_paratha.jpg",
      "description": "A traditional Pakistani flatbread stuffed with a spiced potato filling.",
      "ingredients": [
        "2 potatoes",
        "1 onion",
        "1 green chili",
        "Cumin seeds",
        "Garam masala",
        "Salt",
        "Dough",
        "Ghee or oil"
      ],
      "cookingTime": "45 minutes"
    },
    {
      "id": "613b8b1c28a914001b7d28ae",
      "title": "Nihari",
      "steps": [
        "Heat 1/2 cup of oil in a large pot and fry 2 sliced onions until golden brown.",
        "Add 1 tablespoon of ginger-garlic paste and cook for a minute.",
        "Add 500g of beef shank and cook until browned on all sides.",
        "Add 2 tablespoons of nihari masala, 1 tablespoon of red chili powder, 1 teaspoon of turmeric powder, and salt to taste.",
        "Pour in 4 cups of water, cover, and cook on low heat for 6-8 hours until the meat is tender and the gravy thickens.",
        "Dissolve 1 tablespoon of wheat flour in water to make a paste and stir into the gravy to thicken.",
        "Garnish with sliced ginger, green chilies, and lemon wedges before serving."
      ],
      "image": "/nihari.jpg",
      "description": "A slow-cooked beef stew with a rich and spicy gravy, typically served for breakfast.",
      "ingredients": [
        "500g beef shank",
        "2 onions",
        "Ginger-garlic paste",
        "Nihari masala",
        "Red chili powder",
        "Turmeric powder",
        "Salt",
        "Water",
        "Wheat flour",
        "Oil",
        "Ginger",
        "Green chilies",
        "Lemon wedges"
      ],
      "cookingTime": "8 hours"
    },
    {
      "id": "613b8b1c28a914001b7d28af",
      "title": "Seekh Kebabs",
      "steps": [
        "In a large bowl, mix 500g of minced beef or lamb with 1 chopped onion, 1 tablespoon of ginger-garlic paste, 2 teaspoons of red chili powder, 1 teaspoon of garam masala, 1 teaspoon of cumin powder, and salt to taste.",
        "Add a handful of chopped coriander leaves and mix well.",
        "Take small portions of the mixture and shape them onto skewers.",
        "Grill or barbecue the kebabs on medium heat for 10-15 minutes, turning occasionally, until cooked through and slightly charred.",
        "Serve hot with naan or chutney."
      ],
      "image": "/seekh_kebab.jpg",
      "description": "Spicy and flavorful kebabs made from minced meat, grilled to perfection.",
      "ingredients": [
        "500g minced beef or lamb",
        "1 onion",
        "Ginger-garlic paste",
        "Red chili powder",
        "Garam masala",
        "Cumin powder",
        "Salt",
        "Coriander leaves"
      ],
      "cookingTime": "30 minutes"
    }
  ]
  